In [15]:
import pandas as pd

In [16]:
df = pd.read_csv('Metro_zhvi_bdrmcnt_2_uc_sfrcondo_tier_0.33_0.67_sm_sa_month.csv')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 851 entries, 0 to 850
Columns: 302 entries, RegionID to 2024-09-30
dtypes: float64(297), int64(2), object(3)
memory usage: 2.0+ MB

In [18]:
df.shape

(851, 302)

In [19]:
df.sample()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2023-12-31,2024-01-31,2024-02-29,2024-03-31,2024-04-30,2024-05-31,2024-06-30,2024-07-31,2024-08-31,2024-09-30
540,394446,562,"Cedar City, UT",msa,UT,NaN,NaN,NaN,NaN,NaN,...,307284.74767,306303.57032,305100.759414,304449.395639,304151.410616,302497.180406,299958.401606,296581.477415,294034.705668,292843.11988

In [8]:
# list(df.columns)

In [20]:
df.columns

Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
       '2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30', '2000-05-31',
       ...
       '2023-12-31', '2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
       '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31', '2024-09-30'],
      dtype='object', length=302)

In [21]:
time_cols = ['2000-01-31','2000-02-29','2000-03-31','2000-04-30',
 '2000-05-31','2000-06-30','2000-07-31','2000-08-31','2000-09-30',
 '2000-10-31','2000-11-30','2000-12-31','2001-01-31','2001-02-28',
 '2001-03-31','2001-04-30','2001-05-31','2001-06-30','2001-07-31',
 '2001-08-31','2001-09-30','2001-10-31','2001-11-30','2001-12-31',
 '2002-01-31', '2002-02-28', '2002-03-31', '2002-04-30','2002-05-31',
 '2002-06-30', '2002-07-31', '2002-08-31', '2002-09-30', '2002-10-31',
 '2002-11-30', '2002-12-31', '2003-01-31', '2003-02-28', '2003-03-31',
 '2003-04-30', '2003-05-31', '2003-06-30', '2003-07-31', '2003-08-31',
 '2003-09-30', '2003-10-31', '2003-11-30', '2003-12-31', '2004-01-31', '2004-02-29',
 '2004-03-31','2004-04-30', '2004-05-31', '2004-06-30', '2004-07-31', '2004-08-31','2004-09-30',
 '2004-10-31', '2004-11-30', '2004-12-31','2005-01-31', '2005-02-28', '2005-03-31', '2005-04-30',
 '2005-05-31', '2005-06-30', '2005-07-31', '2005-08-31', '2005-09-30', '2005-10-31', '2005-11-30',
 '2005-12-31', '2006-01-31', '2006-02-28', '2006-03-31', '2006-04-30','2006-05-31',
 '2006-06-30', '2006-07-31', '2006-08-31', '2006-09-30', '2006-10-31', '2006-11-30', '2006-12-31',
 '2007-01-31', '2007-02-28', '2007-03-31', '2007-04-30', '2007-05-31', '2007-06-30', '2007-07-31',
 '2007-08-31', '2007-09-30', '2007-10-31', '2007-11-30', '2007-12-31', '2008-01-31', '2008-02-29',
 '2008-03-31','2008-04-30','2008-05-31','2008-06-30','2008-07-31','2008-08-31','2008-09-30',
 '2008-10-31','2008-11-30', '2008-12-31', '2009-01-31', '2009-02-28', '2009-03-31', '2009-04-30',
 '2009-05-31','2009-06-30','2009-07-31','2009-08-31','2009-09-30','2009-10-31','2009-11-30',
 '2009-12-31','2010-01-31','2010-02-28','2010-03-31','2010-04-30','2010-05-31',
 '2010-06-30','2010-07-31','2010-08-31', '2010-09-30', '2010-10-31', '2010-11-30','2010-12-31','2011-01-31',
 '2011-02-28','2011-03-31','2011-04-30','2011-05-31','2011-06-30','2011-07-31','2011-08-31','2011-09-30',
 '2011-10-31','2011-11-30','2011-12-31','2012-01-31','2012-02-29','2012-03-31','2012-04-30',
 '2012-05-31','2012-06-30','2012-07-31','2012-08-31','2012-09-30','2012-10-31',
 '2012-11-30', '2012-12-31', '2013-01-31', '2013-02-28', '2013-03-31', '2013-04-30', '2013-05-31','2013-06-30','2013-07-31',
 '2013-08-31', '2013-09-30', '2013-10-31', '2013-11-30','2013-12-31', '2014-01-31', '2014-02-28',
 '2014-03-31', '2014-04-30', '2014-05-31','2014-06-30','2014-07-31','2014-08-31',
 '2014-09-30', '2014-10-31','2014-11-30','2014-12-31', '2015-01-31', '2015-02-28',
 '2015-03-31','2015-04-30', '2015-05-31', '2015-06-30','2015-07-31','2015-08-31', '2015-09-30',
 '2015-10-31', '2015-11-30', '2015-12-31', '2016-01-31', '2016-02-29', '2016-03-31',
 '2016-04-30','2016-05-31','2016-06-30',
 '2016-07-31', '2016-08-31','2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31',
 '2017-01-31', '2017-02-28', '2017-03-31', '2017-04-30', '2017-05-31', '2017-06-30', '2017-07-31',
 '2017-08-31', '2017-09-30', '2017-10-31', '2017-11-30', '2017-12-31','2018-01-31','2018-02-28',
 '2018-03-31', '2018-04-30', '2018-05-31', '2018-06-30', '2018-07-31', '2018-08-31',
 '2018-09-30', '2018-10-31', '2018-11-30', '2018-12-31','2019-01-31','2019-02-28','2019-03-31',
 '2019-04-30', '2019-05-31', '2019-06-30', '2019-07-31', '2019-08-31', '2019-09-30', '2019-10-31', '2019-11-30', '2019-12-31',
 '2020-01-31', '2020-02-29','2020-03-31','2020-04-30','2020-05-31','2020-06-30','2020-07-31','2020-08-31','2020-09-30',
 '2020-10-31', '2020-11-30', '2020-12-31', '2021-01-31', '2021-02-28',
 '2021-03-31', '2021-04-30', '2021-05-31', '2021-06-30', '2021-07-31', '2021-08-31', '2021-09-30',
 '2021-10-31','2021-11-30','2021-12-31', '2022-01-31','2022-02-28','2022-03-31',
 '2022-04-30','2022-05-31','2022-06-30','2022-07-31','2022-08-31','2022-09-30',
 '2022-10-31','2022-11-30','2022-12-31', '2023-01-31','2023-02-28','2023-03-31',
 '2023-04-30','2023-05-31','2023-06-30','2023-07-31','2023-08-31','2023-09-30',
 '2023-10-31','2023-11-30','2023-12-31','2024-01-31','2024-02-29','2024-03-31',
 '2024-04-30','2024-05-31','2024-06-30','2024-07-31','2024-08-31','2024-09-30']

## Melt the dataframe

In [22]:
df.shape

(851, 302)

In [25]:
df.sample()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2023-12-31,2024-01-31,2024-02-29,2024-03-31,2024-04-30,2024-05-31,2024-06-30,2024-07-31,2024-08-31,2024-09-30
584,753911,608,"Ozark, AL",msa,AL,NaN,NaN,NaN,NaN,NaN,...,95529.689979,95999.44648,96381.228936,97091.524091,98185.434861,99358.807267,100170.309181,100421.976483,100459.92184,100084.901466

In [26]:
melted_df = df.melt(id_vars=['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',]
                    ,value_vars=time_cols, )

In [27]:
melted_df.shape

(252747, 7)

In [29]:
melted_df.sample(3)

,RegionID,SizeRank,RegionName,RegionType,StateName,variable,value
206281,394778,349,"Lawrence, KS",msa,KS,2020-03-31,147935.114338
243174,394886,667,"Mount Pleasant, TX",msa,TX,2023-10-31,158700.083631
47111,394577,315,"Eureka, CA",msa,CA,2004-08-31,188485.635757

In [30]:
melted_df.rename({'variable':'Timestamp'}, axis='columns', inplace=True)

In [31]:
melted_df.sample(3)

,RegionID,SizeRank,RegionName,RegionType,StateName,Timestamp,value
65268,395043,618,"Ruston, LA",msa,LA,2006-05-31,73512.693779
73350,394741,168,"Kennewick, WA",msa,WA,2007-03-31,124093.427477
241486,394449,681,"Celina, OH",msa,OH,2023-08-31,162484.243546

In [32]:
melted_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252747 entries, 0 to 252746
Data columns (total 7 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   RegionID    252747 non-null  int64
 1   SizeRank    252747 non-null  int64
 2   RegionName  252747 non-null  object
 3   RegionType  252747 non-null  object
 4   StateName   252450 non-null  object
 5   Timestamp   252747 non-null  object
 6   value       206019 non-null  float64
dtypes: float64(1), int64(2), object(4)
memory usage: 13.5+ MB